Revit 2026 API

# FamilyInstanceStructuralType Property

---

Provides the primary structural type of the instance, such as beam or column etc.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public StructuralType StructuralType { get; }
```
```vb
Public ReadOnly Property StructuralType As StructuralType
	Get
```
```cpp
public:
property StructuralType StructuralType {
	StructuralType get ();
}
```
```fsharp
member StructuralType : StructuralType with get
```

#### Property Value

StructuralType

#### Reference

FamilyInstance Class

Autodesk.Revit.DB Namespace